[Table of Contents](../../index.ipynb)

# FRC Analytics with Python - Session 16
# Structured Query Language (SQL)
**Last Updated: 8 October 2021**

This session covers *Structured Query Language* (SQL). SQL is used to to create, modify, and retrieve data stored in relational databases. SQL has been in general use since the 1980s and is required knowledge for data scientists and business analysts. SQL is included in our curriculum because the Issaquah Robotics Society's scouting system uses SQL to store, retrieve, and manipulate data.

A *database* is a software program that stores information. Relational databases are a type of database that store data in tables with rows and columns. Databases often run on computer servers and provide information to other computer programs over a network. For example, when a web browser retrieves a web page, the web page is generated by a web server like Apache, Microsoft Internet Information Services (IIS), or Nginx. Web servers typically retrieve data from relational database servers when they construct a web page. MySQL, PostgreSQL, and Oracle are some of the most common relational database servers.

The IRS's scouting system uses a simple relational database called *Sqlite*. Sqlite is bundeled with Python, so if you've installed Python on your computer, you already have Sqlite.

##### If Using Google Colab
It's best if you clone the *pyclass_frc* Github repo and run this notebook from your local computer. But if you would like to run it from Google Colab, uncomment and run the line in the next cell. (*Don't delete the exclamation point at the start of the line!*) The cell will copy a Sqlite database file from the Github repository.

In [1]:
# !wget -nv https://raw.githubusercontent.com/irs1318dev/pyclass_frc/master/sessions/s17_SQL/wasno2020.sqlite3

## I. Getting a Database Connection
To use a Sqlite database, we must first import the `sqlite3` package. This package is part of the *Python Standard Library*, so there is no need to install it with Anaconda. In addition to `sqlite3`, we'll also need the `pandas` package.

In [2]:
import sqlite3

import pandas as pd

A Sqlite database is stored as a file. Our database is contained in the file *wasno2020.sqlite3*. It contains scouting data from the 2020 Pacific Northwest (PNW) district competition at Glacier Peak High School in Snohomish, WA. We can get a connection to this database by using the `sqlite3.connect()` function.

In [3]:
# Get a connection to the database
con = sqlite3.connect("wasno2020.sqlite3")

## II. Getting Started

### A. Our First Query
The instructions that we'll give to our database are called queries. Run the next cell to see the results of our first query.

In [9]:
# Our first SQL Query
query = "SELECT * FROM teams;"

# This statement runs the query. We'll explain it later.
teams_dataframe = pd.read_sql_query(query, con, index_col = "team_id")

# Display the first six rows
teams_dataframe.head()

,team_number,team_name,city,state,region,year_founded,matches_played
team_id,,,,,,,
1,1318,Issaquah Robotics Society,Issaquah,Washington,None,2004.0,10
2,2928,Viking Robotics,Seattle,Washington,None,2009.0,10
3,2903,NeoBots,Arlington,Washington,None,2009.0,10
4,3070,Team Pronto,Seattle,Washington,None,2009.0,9
5,2930,Sonic Squirrels,Snohomish,Washington,None,2009.0,10

The first line of the code cell defines a SQL query, `SELECT * FROM teams;`and saves it in a Python variable. The next line sends the query to our *Sqlite* database and converts the results to a *Pandas* dataframe. Don't pay much attention to this line -- we'll cover it in more detail later. The final statement displays the first six records that were retrieved from the database.

The data from the *teams* table consists of rows and columns. Each row corresponds to a different robotics team, and each column represents a different attribute of a team, such as its name, city or year founded. Rows are often called *records* and the attribute represented by a column is often called a *field*.

This particular SQL query, `SELECT * FROM teams;`, requests all data from the *teams* table. The SQL query has several components.
* Our query started with the SQL keyword `SELECT`, which means we want to retrieve data from the database.
* The asterisk, `*`, means we want to return all columns. If you were reading a SQL query out load, you could say "all columns" or "all fields" instead of "asterisk".
* The phrase `FROM teams` means we want to the data to come from the *teams* table. `FROM` is a SQL keyword and `teams` is a user-created name that we gave to our database table.
* All SQL queries end with a semicolon, `;`.

### B. Choosing Columns
We can replace the asterisk in the `SELECT` statement with one or more column names. For example, we could modify the query to provide only the *team_name* and *team_number* columns.

In [10]:
# We can choose our columns
query = """SELECT team_name, team_number FROM teams;"""

# Don't worry about this statement yet
teams_dataframe = pd.read_sql_query(query, con)

# Display the first six rows
teams_dataframe.head()

                   team_name team_number
0  Issaquah Robotics Society        1318
1            Viking Robotics        2928
2                    NeoBots        2903
3                Team Pronto        3070
4            Sonic Squirrels        2930

`SELECT` statements will accept one or more column names. If providing more than one column name, separate the column names with commas.

### C. Displaying Different Column Names
Using underscores to separate the words in long column names is a good practice, but it does make our tables look a bit crude.  We can use aliases to display the columns using a different name and make our table look more polished.

In [12]:
# We can choose our columns
query = """SELECT team_name AS Team,
                  team_number AS "Team Number"
             FROM teams;"""

# Don't worry about this statement yet
teams_dataframe = pd.read_sql_query(query, con)

# Display the first six rows
teams_dataframe.head()

                        Team Team Number
0  Issaquah Robotics Society        1318
1            Viking Robotics        2928
2                    NeoBots        2903
3                Team Pronto        3070
4            Sonic Squirrels        2930

The `AS` keyword caused the columns to be renamed when our results were displayed. We can include spaces in our column name if we enclose the name in double quotes (but then the entire string needs to be enclosed in single or triple quotes).

### D. Filtering Results with a WHERE Clause
The following query only returns teams that were founded in 2013.

In [24]:
# We can filter the results with a WHERE clause.
query = """SELECT *
             FROM teams
            WHERE year_founded = 2013;"""

# Don't worry about this statement yet
teams_dataframe = pd.read_sql_query(query, con, index_col="team_id")

# Display the first six rows
teams_dataframe

,team_number,team_name,city,state,region,year_founded,matches_played
team_id,,,,,,,
8,4681,Murphy's law,Everett,Washington,None,2013,10
11,4682,BraveBots,Seattle,Washington,None,2013,9
18,4683,Full Metal Robotics,Marysville,Washington,None,2013,10
23,4512,BEAR bots,Everett,Washington,None,2013,9
29,4513,Circuit Breakers,Medical Lake,Washington,None,2013,10

We filtered the query results by adding a `WHERE` clause. Here are a couple key points:
* The order of clauses matters. The `WHERE` clause must come after the `FROM` clause, or else the SQL query will fail.
* Unlike Python, the equality operator, `=`, contains a single equals sign.

We can use the Boolean operators `AND`, `OR`, and `NOT` in our `WHERE` clause.

In [32]:
# We can use Boolean operators in the WHERE clause.
query = """SELECT *
             FROM teams
            WHERE year_founded <= 2012
              AND city = 'Seattle';"""

# Don't worry about this statement yet
teams_dataframe = pd.read_sql_query(query, con, index_col="team_id")

# Display the first six rows
teams_dataframe

,team_number,team_name,city,state,region,year_founded,matches_played
team_id,,,,,,,
2,2928,Viking Robotics,Seattle,Washington,None,2009,10
4,3070,Team Pronto,Seattle,Washington,None,2009,9
31,4180,Iron Riders,Seattle,Washington,None,2012,9

The query displays all teams in Seattle that were founded in 2012 or earlier. Here are a couple important things to note:
* The value *Seattle* is surrounded by single quotes (`'`) but the value *2012* does not use any quotes. This is because the *year_founded* has a numeric datatype and *city* has a text datatype. Literal text values should always be surrounded by *single* quotes. (*Sqlite* will let you use double quotes around literal strings, but other common database servers, like *Postgres*, will not. It's best get in the habit of using single quotes in this situation.)
* While SQL keywords and user-supplied identifiers are case insensitive, SQL searches often are case-sensitive. For example, if we change our the second part of our `WHERE` clause to `AND city = 'seattle'`, our search will return no results (try it for yourself!) because all occurrences of 'Seattle' in the *teams* table are capitalized. *Sqlite* queries can be forced to conduct a case-insensitive search by adding `COLLATE NOCASE` to the end of the `WHERE` clause. Also, it's possible to specify that searches should be case-insensitive when creating a database table.

### E. SQL Syntax and Style
Unlike Python, SQL is case insensitive. SQL considers the queries `SELECT * FROM teams;` and `select * frOM TEAMS;` to be identical. This means you can't have two tables where the only differences in the table names are that some characters are upper or lower case.

To make our queries easy to read and understand, we will conform to a few style rules. These style rules come from a [SQL styleguide by Simon Holywell](https://www.sqlstyle.guide/). 
* SQL keywords like `SELECT` and `FROM` will always be all uppercase.
* User-generated table and column names will always be all lowercase.
* If table or column names contain multiple words, the words will be separated by underscores.
* Longer queries will be placed on multiple lines, with the leftmost keywords right-aligned.
* Table names will be a plural noun that describes the data stored in the table.

In addition, when writing SQL queries in Python code, the mentor recommends placing SQL queries in triple-quoted strings. This practice has two advantages:
* It allows multi-line queries, which enhances readability.
* Double quotes (`"`) and single quotes (`'`) occur frequently in SQL queries. Single and double quotes can easily be placed in single-quoted strings.

## II. Tables and Schemas

### A. Getting a Table of Tables
Most relational databases contain multiple tables. We can run a special `SELECT` query to see what tables exist in a database.

In [61]:
# Get a list of tables in the database
query = """SELECT *
             FROM sqlite_schema
             WHERE type = 'table';"""

# Run the query and display the results
pd.read_sql_query(query, con)

,type,name,tbl_name,rootpage,sql
0,table,measures,measures,53,"CREATE TABLE ""measures"" (\n""index"" INTEGER,\n ..."
1,table,status,status,115,"CREATE TABLE ""status"" (\n""index"" INTEGER,\n ""..."
2,table,teams,teams,114,CREATE TABLE teams (\n team_id INTEGER PRIM...
3,table,schedule,schedule,2,"CREATE TABLE ""schedule"" (\n match_id..."

The results indicate our database contains four tables: *measures*, *schedule*, *status*, and *teams*.

*Sqlite* databases always contain a special table called *sqlite_schema*, which lists all objects contained in the database. The *sqlite_schema* table contains five columns:
1. `type`: Specifies the type of object. There are four possible values: 'table', 'index', 'view', and 'trigger'. We used a `WHERE` clause to filter the results to just tables. 
2. `name`: The name of the object. For tables, this column contains the table's name.
3. `tbl_name`: Indexes and triggers are always associated with a table. This column specifies the associated table. But for tables and views, the value in this column is always the same as the *name* column.
4. `rootpage`: We won't be using this column. But if you must know, *Sqlite* uses a datastructure called a *B-tree* (NOT the same as a binary tree) to store objects. This column contains the location of the table within the B-tree.
5. `sql`: Contains the SQL query that was used to create the table.

### B. Database Schemas
The arrangement of database tables, including the table's fields and data types, is called a schema. We can learn more about a database schema by inspecting the *sql* fields in the *sqlite_schema* table. For example, the following query retrieves the query that was used to create the *teams* table.

In [65]:
# Get a list of tables in the database
query = """SELECT sql
             FROM sqlite_schema
             WHERE type = 'table'
               AND name = 'teams';"""

# Run the query and display the results
print(con.execute(query).fetchone()[0])

CREATE TABLE teams (
    team_id INTEGER PRIMARY KEY,
    team_number TEXT NOT NULL UNIQUE,
    team_name TEXT,
    city TEXT,
    state TEXT,
    region TEXT,
    year_founded INTEGER,
    matches_played INTEGER
)

The `CREATE TABLE` query is used to create a new table in a SQL database.  Viewing the `CREATE TABLE` query is useful because it lists all of the columns and their datatypes for a specific table. For the *teams* table, we can see that all columns have a *TEXT* datatype except for *team_id*, *year_founded*, and *matches_played*. Note that the datatype of *team_number* is actually text, even though all of the values appear to be numeric. 

The important takeaway is that all columns have a specific datatype, and only data that matches the datatype can be stored in the column. We'll cover `CREATE TABLE` queries in greater detail in a later session.

#### Pragma Queries
*Sqlite* provides another method for retrieving information about a table. The following query extracts information about the *schedule* table.

In [86]:
query = """PRAGMA table_info(schedule);"""
pd.read_sql_query(query, con, index_col="cid")

           name     type  notnull dflt_value  pk
cid
0      match_id  INTEGER        0       None   1
1    match_date     TEXT        1       None   0
2    comp_level     TEXT        1       None   0
3      alliance     TEXT        1       None   0
4          team     TEXT        1       None   0
5       station     TEXT        1       None   0
6    last_match  INTEGER        0       None   0

Results from `PRAGMA table_info(...)` include six different columns:
* `cid`: Contains the column ID, which is a sequence of integers, starting with zero for the first column.
* `name`: The column name.
* `type`: The column data type.
* `notnull`: If 1, the column must contain information -- it cannot be empty.
* `dflt_value`: Contains the column's default value. The default value is inserted into the column when creating a new record if no value is specified by the user.
* `pk`: If 1, indicates the column is a primary key. Primary keys will be covered in a later session.

In [80]:
query = """SELECT * FROM schedule2;"""
pd.read_sql_query(query, con)

,match_id,match_date,comp_level,alliance,team,station,last_match
0,205768,2020-02-29T11:00:00,qual,001-q,red,4131,10
1,205769,2020-02-29T11:00:00,qual,001-q,red,4683,10
2,205770,2020-02-29T11:00:00,qual,001-q,red,2412,9
3,205771,2020-02-29T11:00:00,qual,001-q,blue,1318,10
4,205772,2020-02-29T11:00:00,qual,001-q,blue,4089,9
...,...,...,...,...,...,...,...
355,206123,2020-03-01T09:30:00,qual,060-q,red,4173,1
356,206124,2020-03-01T09:30:00,qual,060-q,red,4683,1
357,206125,2020-03-01T09:30:00,qual,060-q,blue,949,1
358,206126,2020-03-01T09:30:00,qual,060-q,blue,2910,1
359,206127,2020-03-01T09:30:00,qual,060-q,blue,5588,1

In [70]:
query = """SELECT * FROM measures;"""
pd.read_sql_query(query, con).columns

Index(['index', 'date', 'event', 'season', 'level', 'match', 'alliance',
       'team', 'station', 'actor', 'task', 'measuretype', 'phase', 'attempt',
       'reason', 'capability', 'successes', 'attempts', 'cycle_times',
       'last_match', 'num_matches'],
      dtype='object')

In [71]:
query = """SELECT * FROM status;"""
pd.read_sql_query(query, con)

   index  event_id  match                 date
0      0     25395  060-q  2020-03-01T09:30:00

In [53]:
df_measures = pd.read_sql_query("SELECT * FROM enum_measures", con)
pd.unique(df_measures.task)

array(['startingPosition_Goal', 'movedAuto', 'launchOuter',
       'pickupPowerCellsG', 'pickupPowerCellsL', 'launchInner',
       'defendedAgainst', 'launchLower', 'startingPosition_Cen',
       'climbPosition_Park', 'tempDisabled', 'disabled',
       'climbPosition_Side', 'startingPosition_Load', 'isLevel',
       'crossOpponentSector', 'pickupPowerCellsT', 'collided', 'defense',
       'passPowerCells', 'climbPosition_Center', 'pickupPowerCellsS',
       'noShow', 'fallOver'], dtype=object)

In [52]:
df_measures = pd.read_sql_query("SELECT * FROM measures", con)
pd.unique(df_measures.task)

array(['startingPosition', 'movedAuto', 'launchOuter',
       'pickupPowerCellsG', 'pickupPowerCellsL', 'launchInner',
       'defendedAgainst', 'launchLower', 'climbPosition', 'tempDisabled',
       'disabled', 'isLevel', 'crossOpponentSector', 'pickupPowerCellsT',
       'collided', 'defense', 'passPowerCells', 'pickupPowerCellsS',
       'noShow', 'fallOver'], dtype=object)

In [56]:
pd.read_sql_query("""SELECT * FROM enum_measures WHERE task = 'startingPosition_Goal';""", con)

,index,date,event,season,level,match,alliance,team,station,actor,...,measuretype,phase,attempt,reason,capability,successes,attempts,cycle_times,last_match,num_matches
0,0,2020-02-29T16:29:00,wasno,2020,qual,034-q,blue,1294,1,robot,...,enum,auto,summary,na,Goal,1,0,0,4,9
1,3,2020-02-29T15:03:00,wasno,2020,qual,024-q,red,1294,1,robot,...,enum,auto,summary,na,Goal,1,0,0,6,9
2,15,2020-02-29T17:25:00,wasno,2020,qual,042-q,blue,1294,3,robot,...,enum,auto,summary,na,Goal,1,0,0,3,9
3,21,2020-02-29T18:42:00,wasno,2020,qual,053-q,blue,1294,3,robot,...,enum,auto,summary,na,Goal,1,0,0,1,9
4,31,2020-02-29T11:18:00,wasno,2020,qual,003-q,blue,1294,2,robot,...,enum,auto,summary,na,Goal,1,0,0,9,9
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
113,1371,2020-02-29T16:15:00,wasno,2020,qual,032-q,red,7461,1,robot,...,enum,auto,summary,na,Goal,1,0,0,5,10
114,1457,2020-02-29T16:22:00,wasno,2020,qual,033-q,blue,8032,3,robot,...,enum,auto,summary,na,Goal,1,0,0,5,10
115,1472,2020-02-29T14:49:00,wasno,2020,qual,022-q,blue,8059,2,robot,...,enum,auto,summary,na,Goal,1,0,0,7,10
116,1525,2020-02-29T14:28:00,wasno,2020,qual,019-q,red,949,1,robot,...,enum,auto,summary,na,Goal,1,0,0,7,10
117,1526,2020-02-29T14:07:00,wasno,2020,qual,016-q,blue,949,2,robot,...,enum,auto,summary,na,Goal,1,0,0,8,10

In [34]:
query = """SELECT *
             FROM sqlite_master 
            WHERE type ='table';"""
pd.read_sql_query(query, con)

,type,name,tbl_name,rootpage,sql
0,table,measures,measures,2,"CREATE TABLE ""measures"" (\n""index"" INTEGER,\n ..."
1,table,enum_measures,enum_measures,53,"CREATE TABLE ""enum_measures"" (\n""index"" INTEGE..."
2,table,schedule,schedule,105,"CREATE TABLE ""schedule"" (\n""index"" INTEGER,\n ..."
3,table,status,status,115,"CREATE TABLE ""status"" (\n""index"" INTEGER,\n ""..."
4,table,Old_Teams,Old_Teams,113,"CREATE TABLE ""Old_Teams"" (\n""id"" INTEGER,\n ""..."
5,table,teams,teams,114,CREATE TABLE teams (\n team_id INTEGER PRIM...

### A. `pandas.read_sql_query()` Function


Of course, nothing is going to happen unless we can get the database to evaluate the SQL query and follow its instructions. For our first query, we sent the query to the database using the [`read_sql_query()` function from the *Pandas* package](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_sql_query.html#pandas.read_sql_query). *Sqlite* executed the query and sent the requested data to *Pandas*.  *Pandas* assembled the data into a dataframe object.

We also had to pass the *Sqlite* connection object to the `read_sql_query()` function. Without the connection object, Pandas would have no clue which database we wanted to use.

### B. Database Table


The *teams* table in our relational database contains eight columns, named *id*, *name*, *long_name*, *city*, *state*, *region*, *year_founded*, and *matches_played*. The column on the far left that contains the values 0 through 5 is not from the *Sqlite* database. It is an index column created by *Pandas*. By the way, this data was saved after the first day of competition, so none of the FRC teams had completed all of their qualification matches.

In [4]:
cur = con.cursor()

In [28]:
q = "ALTER TABLE Teams RENAME TO Old_Teams;"
con.execute(q)
con.close()

In [3]:
q = """SELECT name
FROM sqlite_master 
WHERE type ='table' AND 
    name NOT LIKE 'sqlite_%';
"""
pd.read_sql(q, con)

            name
0       measures
1  enum_measures
2       schedule
3         status
4      Old_Teams
5          teams

In [33]:
q = """SELECT * FROM teams;"""
for row in cur.execute(q):
    print(row)

(1, '1318', 'Issaquah Robotics Society', 'Issaquah', 'Washington', None, 2004, 10)
(2, '2928', 'Viking Robotics', 'Seattle', 'Washington', None, 2009, 10)
(3, '2903', 'NeoBots', 'Arlington', 'Washington', None, 2009, 10)
(4, '3070', 'Team Pronto', 'Seattle', 'Washington', None, 2009, 9)
(5, '2930', 'Sonic Squirrels', 'Snohomish', 'Washington', None, 2009, 10)
(6, '1294', 'Top Gun', 'Sammamish', 'Washington', None, 2004, 9)
(7, '949', 'Wolverine Robotics', 'Bellevue', 'Washington', None, 2002, 10)
(8, '4681', "Murphy's law", 'Everett', 'Washington', None, 2013, 10)
(9, '4205', 'ROBOCUBS', 'Sedro Woolley', 'Washington', None, 2012, 10)
(10, '4911', 'CyberKnights', 'Seattle', 'Washington', None, 2014, 10)
(11, '4682', 'BraveBots', 'Seattle', 'Washington', None, 2013, 9)
(12, '4309', '4-H Botsmiths', 'Snohomish', 'Washington', None, 2012, 10)
(13, '1778', 'Chill Out', 'Mountlake Terrace', 'Washington', None, 2006, 10)
(14, '4173', ' IMVERT (Interscholastic Mount Vernon Engineering Robotics Team)', 'Mount Vernon', 'Washington', None, 2012, 10)
(15, '5588', 'Reign Robotics', 'Seattle', 'Washington', None, 2015, 10)
(16, '8032', None, None, None, None, None, 10)
(17, '8248', 'ChainLynx', None, None, None, None, 10)
(18, '4683', 'Full Metal Robotics', 'Marysville ', 'Washington', None, 2013, 10)
(19, '1899', 'Saints Robotics', 'Bellevue', 'Washington', None, 2006, 9)
(20, '7461', None, None, None, None, None, 10)
(21, '3826', 'Sequim Robotics Federation "SRF" ', 'Sequim', 'Washington', None, 2011, 10)
(22, '4131', None, None, None, None, None, 10)
(23, '4512', 'BEAR bots', 'Everett', 'Washington', None, 2013, 9)
(24, '4918', 'The Roboctopi', 'Port Townsend', 'Washington', None, 2014, 10)
(25, '2522', 'Royal Robotics', 'Lynnwood', 'Washington', None, 2008, 10)
(26, '2976', 'Spartabots', 'Sammamish', 'Washington', None, 2009, 9)
(27, '7118', 'ScotBots', 'Shoreline', 'Washington', None, 2018, 9)
(28, '2910', 'Jack in the Bot', 'Mill Creek', 'Washington', None, 2009, 10)
(29, '4513', 'Circuit Breakers', 'Medical Lake', 'Washington', None, 2013, 10)
(30, '492', 'Titan Robotics Club', 'Bellevue', 'Washington', None, 2001, 10)
(31, '4180', 'Iron Riders', 'Seattle', 'Washington', None, 2012, 9)
(32, '4915', 'Spartronics', 'Bainbridge Island', 'Washington', None, 2014, 10)
(33, '7627', None, None, None, None, None, 10)
(34, '3268', 'Vahallabots', 'Kenmore', 'Washington', None, 2010, 10)
(35, '2412', 'Robototes', 'Bellevue', 'Washington', None, 2008, 9)
(36, '8059', None, None, None, None, None, 10)
(37, '4089', 'Stealth Robotics', 'Duvall', 'Washington', None, 2012, 9)

In [30]:
dq = "DELETE FROM teams;"
cur.execute(dq)
con.commit()

In [ ]:
q = "SELECT * FROM old_teams;"
rows = cur.execute(q).fetchall()
rows

In [79]:
q = "SELECT * FROM schedule;"
cur = con.cursor()
rows = cur.execute(q)
ins_cur = con.cursor()
for row in rows:
    print(row)
    insert_q = """INSERT INTO schedule2
                  (last_match, match_id, match_date, comp_level, alliance, team, station)
                  VALUES (?, ?, ?, ?, ?, ?, ?);"""
    ins_cur.execute(insert_q, row[1:-2])
con.commit()

(0, 1, 206124, '2020-03-01T09:30:00', 'qual', '060-q', 'red', '4683', '3', 25395)
(1, 1, 206122, '2020-03-01T09:30:00', 'qual', '060-q', 'red', '3268', '1', 25395)
(2, 1, 206125, '2020-03-01T09:30:00', 'qual', '060-q', 'blue', '949', '1', 25395)
(3, 1, 206123, '2020-03-01T09:30:00', 'qual', '060-q', 'red', '4173', '2', 25395)
(4, 1, 206126, '2020-03-01T09:30:00', 'qual', '060-q', 'blue', '2910', '2', 25395)
(5, 1, 206127, '2020-03-01T09:30:00', 'qual', '060-q', 'blue', '5588', '3', 25395)
(6, 1, 206118, '2020-02-29T19:24:00', 'qual', '059-q', 'red', '1778', '3', 25395)
(7, 1, 206119, '2020-02-29T19:24:00', 'qual', '059-q', 'blue', '2930', '1', 25395)
(8, 1, 206117, '2020-02-29T19:24:00', 'qual', '059-q', 'red', '8032', '2', 25395)
(9, 1, 206116, '2020-02-29T19:24:00', 'qual', '059-q', 'red', '4918', '1', 25395)
(10, 1, 206120, '2020-02-29T19:24:00', 'qual', '059-q', 'blue', '8248', '2', 25395)
(11, 1, 206121, '2020-02-29T19:24:00', 'qual', '059-q', 'blue', '4131', '3', 25395)
(12, 1, 206111, '2020-02-29T19:17:00', 'qual', '058-q', 'red', '3826', '2', 25395)
(13, 1, 206110, '2020-02-29T19:17:00', 'qual', '058-q', 'red', '4205', '1', 25395)
(14, 1, 206112, '2020-02-29T19:17:00', 'qual', '058-q', 'red', '2522', '3', 25395)
(15, 1, 206115, '2020-02-29T19:17:00', 'qual', '058-q', 'blue', '492', '3', 25395)
(16, 1, 206114, '2020-02-29T19:17:00', 'qual', '058-q', 'blue', '7461', '2', 25395)
(17, 1, 206113, '2020-02-29T19:17:00', 'qual', '058-q', 'blue', '8059', '1', 25395)
(18, 1, 206104, '2020-02-29T19:10:00', 'qual', '057-q', 'red', '4911', '1', 25395)
(19, 1, 206109, '2020-02-29T19:10:00', 'qual', '057-q', 'blue', '2928', '3', 25395)
(20, 1, 206107, '2020-02-29T19:10:00', 'qual', '057-q', 'blue', '1318', '1', 25395)
(21, 1, 206106, '2020-02-29T19:10:00', 'qual', '057-q', 'red', '7627', '3', 25395)
(22, 1, 206108, '2020-02-29T19:10:00', 'qual', '057-q', 'blue', '4915', '2', 25395)
(23, 1, 206105, '2020-02-29T19:10:00', 'qual', '057-q', 'red', '4309', '2', 25395)
(24, 1, 206102, '2020-02-29T19:03:00', 'qual', '056-q', 'blue', '4681', '2', 25395)
(25, 1, 206098, '2020-02-29T19:03:00', 'qual', '056-q', 'red', '4512', '1', 25395)
(26, 1, 206103, '2020-02-29T19:03:00', 'qual', '056-q', 'blue', '2903', '3', 25395)
(27, 1, 206100, '2020-02-29T19:03:00', 'qual', '056-q', 'red', '4513', '3', 25395)
(28, 1, 206099, '2020-02-29T19:03:00', 'qual', '056-q', 'red', '4089', '2', 25395)
(29, 2, 206101, '2020-02-29T19:03:00', 'qual', '056-q', 'blue', '949', '1', 25395)
(30, 2, 206093, '2020-02-29T18:56:00', 'qual', '055-q', 'red', '8059', '2', 25395)
(31, 2, 206092, '2020-02-29T18:56:00', 'qual', '055-q', 'red', '4173', '1', 25395)
(32, 2, 206094, '2020-02-29T18:56:00', 'qual', '055-q', 'red', '1778', '3', 25395)
(33, 1, 206097, '2020-02-29T18:56:00', 'qual', '055-q', 'blue', '1899', '3', 25395)
(34, 1, 206095, '2020-02-29T18:56:00', 'qual', '055-q', 'blue', '2412', '1', 25395)
(35, 2, 206096, '2020-02-29T18:56:00', 'qual', '055-q', 'blue', '4918', '2', 25395)
(36, 2, 206087, '2020-02-29T18:49:00', 'qual', '054-q', 'red', '7627', '2', 25395)
(37, 1, 206091, '2020-02-29T18:49:00', 'qual', '054-q', 'blue', '2976', '3', 25395)
(38, 2, 206090, '2020-02-29T18:49:00', 'qual', '054-q', 'blue', '4683', '2', 25395)
(39, 2, 206088, '2020-02-29T18:49:00', 'qual', '054-q', 'red', '2522', '3', 25395)
(40, 1, 206086, '2020-02-29T18:49:00', 'qual', '054-q', 'red', '4180', '1', 25395)
(41, 2, 206089, '2020-02-29T18:49:00', 'qual', '054-q', 'blue', '3826', '1', 25395)
(42, 2, 206081, '2020-02-29T18:42:00', 'qual', '053-q', 'red', '8032', '2', 25395)
(43, 2, 206083, '2020-02-29T18:42:00', 'qual', '053-q', 'blue', '3268', '1', 25395)
(44, 1, 206085, '2020-02-29T18:42:00', 'qual', '053-q', 'blue', '1294', '3', 25395)
(45, 2, 206084, '2020-02-29T18:42:00', 'qual', '053-q', 'blue', '4911', '2', 25395)
(46, 2, 206082, '2020-02-29T18:42:00', 'qual', '053-q', 'red', '4205', '3', 25395)
(47, 2, 206080, '2020-02-29T18:42:00', 'qual', '053-q', 'red', '4309', '1', 25395)
(48, 1, 206079, '2020-02-29T18:35:00', 'qual', '052-q', 'blue', '4682', '3', 25395)
(49, 1, 206075, '2020-02-29T18:35:00', 'qual', '052-q', 'red', '3070', '2', 25395)
(50, 2, 206078, '2020-02-29T18:35:00', 'qual', '052-q', 'blue', '2930', '2', 25395)
(51, 2, 206077, '2020-02-29T18:35:00', 'qual', '052-q', 'blue', '1318', '1', 25395)
(52, 2, 206074, '2020-02-29T18:35:00', 'qual', '052-q', 'red', '492', '1', 25395)
(53, 2, 206076, '2020-02-29T18:35:00', 'qual', '052-q', 'red', '2903', '3', 25395)
(54, 2, 206071, '2020-02-29T18:28:00', 'qual', '051-q', 'blue', '4131', '1', 25395)
(55, 2, 206069, '2020-02-29T18:28:00', 'qual', '051-q', 'red', '4513', '2', 25395)
(56, 2, 206073, '2020-02-29T18:28:00', 'qual', '051-q', 'blue', '5588', '3', 25395)
(57, 2, 206070, '2020-02-29T18:28:00', 'qual', '051-q', 'red', '8248', '3', 25395)
(58, 2, 206068, '2020-02-29T18:28:00', 'qual', '051-q', 'red', '4681', '1', 25395)
(59, 2, 206072, '2020-02-29T18:28:00', 'qual', '051-q', 'blue', '2928', '2', 25395)
(60, 2, 206067, '2020-02-29T18:21:00', 'qual', '050-q', 'blue', '4915', '3', 25395)
(61, 2, 206063, '2020-02-29T18:21:00', 'qual', '050-q', 'red', '2910', '2', 25395)
(62, 2, 206066, '2020-02-29T18:21:00', 'qual', '050-q', 'blue', '7461', '2', 25395)
(63, 1, 206064, '2020-02-29T18:21:00', 'qual', '050-q', 'red', '7118', '3', 25395)
(64, 2, 206065, '2020-02-29T18:21:00', 'qual', '050-q', 'blue', '4089', '1', 25395)
(65, 3, 206062, '2020-02-29T18:21:00', 'qual', '050-q', 'red', '4918', '1', 25395)
(66, 2, 206057, '2020-02-29T18:14:00', 'qual', '049-q', 'red', '1899', '2', 25395)
(67, 2, 206061, '2020-02-29T18:14:00', 'qual', '049-q', 'blue', '2976', '3', 25395)
(68, 3, 206059, '2020-02-29T18:14:00', 'qual', '049-q', 'blue', '8032', '1', 25395)
(69, 3, 206056, '2020-02-29T18:14:00', 'qual', '049-q', 'red', '7627', '1', 25395)
(70, 3, 206060, '2020-02-29T18:14:00', 'qual', '049-q', 'blue', '8059', '2', 25395)
(71, 2, 206058, '2020-02-29T18:14:00', 'qual', '049-q', 'red', '4512', '3', 25395)
(72, 3, 206054, '2020-02-29T18:07:00', 'qual', '048-q', 'blue', '4513', '2', 25395)
(73, 3, 206050, '2020-02-29T18:07:00', 'qual', '048-q', 'red', '4173', '1', 25395)
(74, 2, 206051, '2020-02-29T18:07:00', 'qual', '048-q', 'red', '4180', '2', 25395)
(75, 3, 206052, '2020-02-29T18:07:00', 'qual', '048-q', 'red', '2928', '3', 25395)
(76, 3, 206055, '2020-02-29T18:07:00', 'qual', '048-q', 'blue', '1778', '3', 25395)
(77, 3, 206053, '2020-02-29T18:07:00', 'qual', '048-q', 'blue', '4205', '1', 25395)
(78, 2, 206048, '2020-02-29T18:00:00', 'qual', '047-q', 'blue', '2412', '2', 25395)
(79, 2, 206046, '2020-02-29T18:00:00', 'qual', '047-q', 'red', '3070', '3', 25395)
(80, 3, 206045, '2020-02-29T18:00:00', 'qual', '047-q', 'red', '4681', '2', 25395)
(81, 3, 206047, '2020-02-29T18:00:00', 'qual', '047-q', 'blue', '4911', '1', 25395)
(82, 3, 206049, '2020-02-29T18:00:00', 'qual', '047-q', 'blue', '3826', '3', 25395)
(83, 3, 206044, '2020-02-29T18:00:00', 'qual', '047-q', 'red', '4683', '1', 25395)
(84, 3, 206039, '2020-02-29T17:53:00', 'qual', '046-q', 'red', '492', '2', 25395)
(85, 3, 206038, '2020-02-29T17:53:00', 'qual', '046-q', 'red', '5588', '1', 25395)
(86, 3, 206043, '2020-02-29T17:53:00', 'qual', '046-q', 'blue', '2930', '3', 25395)
(87, 2, 206040, '2020-02-29T17:53:00', 'qual', '046-q', 'red', '1294', '3', 25395)
(88, 3, 206041, '2020-02-29T17:53:00', 'qual', '046-q', 'blue', '2910', '1', 25395)
(89, 3, 206042, '2020-02-29T17:53:00', 'qual', '046-q', 'blue', '4915', '2', 25395)
(90, 3, 206034, '2020-02-29T17:46:00', 'qual', '045-q', 'red', '1318', '3', 25395)
(91, 3, 206037, '2020-02-29T17:46:00', 'qual', '045-q', 'blue', '2903', '3', 25395)
(92, 2, 206032, '2020-02-29T17:46:00', 'qual', '045-q', 'red', '7118', '1', 25395)
(93, 3, 206035, '2020-02-29T17:46:00', 'qual', '045-q', 'blue', '8248', '1', 25395)
(94, 3, 206036, '2020-02-29T17:46:00', 'qual', '045-q', 'blue', '7461', '2', 25395)
(95, 3, 206033, '2020-02-29T17:46:00', 'qual', '045-q', 'red', '4131', '2', 25395)
(96, 3, 206028, '2020-02-29T17:39:00', 'qual', '044-q', 'red', '3268', '3', 25395)
(97, 3, 206031, '2020-02-29T17:39:00', 'qual', '044-q', 'blue', '949', '3', 25395)
(98, 2, 206029, '2020-02-29T17:39:00', 'qual', '044-q', 'blue', '4682', '1', 25395)
(99, 3, 206027, '2020-02-29T17:39:00', 'qual', '044-q', 'red', '4309', '2', 25395)
(100, 3, 206030, '2020-02-29T17:39:00', 'qual', '044-q', 'blue', '2522', '2', 25395)
(101, 4, 206026, '2020-02-29T17:39:00', 'qual', '044-q', 'red', '2928', '1', 25395)
(102, 3, 206024, '2020-02-29T17:32:00', 'qual', '043-q', 'blue', '4180', '2', 25395)
(103, 4, 206023, '2020-02-29T17:32:00', 'qual', '043-q', 'blue', '8059', '1', 25395)
(104, 4, 206025, '2020-02-29T17:32:00', 'qual', '043-q', 'blue', '4918', '3', 25395)
(105, 4, 206020, '2020-02-29T17:32:00', 'qual', '043-q', 'red', '4915', '1', 25395)
(106, 4, 206021, '2020-02-29T17:32:00', 'qual', '043-q', 'red', '4911', '2', 25395)
(107, 3, 206022, '2020-02-29T17:32:00', 'qual', '043-q', 'red', '3070', '3', 25395)
(108, 4, 206018, '2020-02-29T17:25:00', 'qual', '042-q', 'blue', '3826', '2', 25395)
(109, 4, 206017, '2020-02-29T17:25:00', 'qual', '042-q', 'blue', '8032', '1', 25395)
(110, 3, 206019, '2020-02-29T17:25:00', 'qual', '042-q', 'blue', '1294', '3', 25395)
(111, 3, 206016, '2020-02-29T17:25:00', 'qual', '042-q', 'red', '2412', '3', 25395)
(112, 3, 206015, '2020-02-29T17:25:00', 'qual', '042-q', 'red', '4089', '2', 25395)
(113, 4, 206014, '2020-02-29T17:25:00', 'qual', '042-q', 'red', '2903', '1', 25395)
(114, 4, 206011, '2020-02-29T17:18:00', 'qual', '041-q', 'blue', '3268', '1', 25395)
(115, 4, 206010, '2020-02-29T17:18:00', 'qual', '041-q', 'red', '1318', '3', 25395)
(116, 4, 206012, '2020-02-29T17:18:00', 'qual', '041-q', 'blue', '4205', '2', 25395)
(117, 3, 206013, '2020-02-29T17:18:00', 'qual', '041-q', 'blue', '7118', '3', 25395)
(118, 3, 206008, '2020-02-29T17:18:00', 'qual', '041-q', 'red', '2976', '1', 25395)
(119, 3, 206009, '2020-02-29T17:18:00', 'qual', '041-q', 'red', '1899', '2', 25395)
(120, 4, 206005, '2020-02-29T17:11:00', 'qual', '040-q', 'blue', '4681', '1', 25395)
(121, 4, 206007, '2020-02-29T17:11:00', 'qual', '040-q', 'blue', '492', '3', 25395)
(122, 4, 206002, '2020-02-29T17:11:00', 'qual', '040-q', 'red', '5588', '1', 25395)
(123, 4, 206006, '2020-02-29T17:11:00', 'qual', '040-q', 'blue', '2522', '2', 25395)
(124, 4, 206004, '2020-02-29T17:11:00', 'qual', '040-q', 'red', '4309', '3', 25395)
(125, 4, 206003, '2020-02-29T17:11:00', 'qual', '040-q', 'red', '8248', '2', 25395)
(126, 4, 205997, '2020-02-29T17:04:00', 'qual', '039-q', 'red', '7461', '2', 25395)
(127, 4, 205999, '2020-02-29T17:04:00', 'qual', '039-q', 'blue', '7627', '1', 25395)
(128, 4, 206001, '2020-02-29T17:04:00', 'qual', '039-q', 'blue', '4513', '3', 25395)
(129, 4, 206000, '2020-02-29T17:04:00', 'qual', '039-q', 'blue', '4683', '2', 25395)
(130, 4, 205996, '2020-02-29T17:04:00', 'qual', '039-q', 'red', '1778', '1', 25395)
(131, 4, 205998, '2020-02-29T17:04:00', 'qual', '039-q', 'red', '2930', '3', 25395)
(132, 4, 205994, '2020-02-29T16:57:00', 'qual', '038-q', 'blue', '4173', '2', 25395)
(133, 4, 205992, '2020-02-29T16:57:00', 'qual', '038-q', 'red', '4131', '3', 25395)
(134, 4, 205995, '2020-02-29T16:57:00', 'qual', '038-q', 'blue', '949', '3', 25395)
(135, 3, 205991, '2020-02-29T16:57:00', 'qual', '038-q', 'red', '4682', '2', 25395)
(136, 4, 205990, '2020-02-29T16:57:00', 'qual', '038-q', 'red', '2910', '1', 25395)
(137, 3, 205993, '2020-02-29T16:57:00', 'qual', '038-q', 'blue', '4512', '1', 25395)
(138, 5, 205987, '2020-02-29T16:50:00', 'qual', '037-q', 'blue', '492', '1', 25395)
(139, 5, 205985, '2020-02-29T16:50:00', 'qual', '037-q', 'red', '4918', '2', 25395)
(140, 5, 205986, '2020-02-29T16:50:00', 'qual', '037-q', 'red', '3826', '3', 25395)
(141, 5, 205984, '2020-02-29T16:50:00', 'qual', '037-q', 'red', '5588', '1', 25395)
(142, 5, 205989, '2020-02-29T16:50:00', 'qual', '037-q', 'blue', '4911', '3', 25395)
(143, 5, 205988, '2020-02-29T16:50:00', 'qual', '037-q', 'blue', '4205', '2', 25395)
(144, 5, 205979, '2020-02-29T16:43:00', 'qual', '036-q', 'red', '2930', '2', 25395)
(145, 4, 205981, '2020-02-29T16:43:00', 'qual', '036-q', 'blue', '7118', '1', 25395)
(146, 5, 205978, '2020-02-29T16:43:00', 'qual', '036-q', 'red', '4513', '1', 25395)
(147, 5, 205980, '2020-02-29T16:43:00', 'qual', '036-q', 'red', '2522', '3', 25395)
(148, 5, 205982, '2020-02-29T16:43:00', 'qual', '036-q', 'blue', '8248', '2', 25395)
(149, 4, 205983, '2020-02-29T16:43:00', 'qual', '036-q', 'blue', '4089', '3', 25395)
(150, 5, 205975, '2020-02-29T16:36:00', 'qual', '035-q', 'blue', '4915', '1', 25395)
(151, 5, 205974, '2020-02-29T16:36:00', 'qual', '035-q', 'red', '3268', '3', 25395)
(152, 5, 205977, '2020-02-29T16:36:00', 'qual', '035-q', 'blue', '1778', '3', 25395)
(153, 5, 205972, '2020-02-29T16:36:00', 'qual', '035-q', 'red', '2903', '1', 25395)
(154, 5, 205976, '2020-02-29T16:36:00', 'qual', '035-q', 'blue', '4683', '2', 25395)
(155, 4, 205973, '2020-02-29T16:36:00', 'qual', '035-q', 'red', '4512', '2', 25395)
(156, 4, 205969, '2020-02-29T16:29:00', 'qual', '034-q', 'blue', '1294', '1', 25395)
(157, 4, 205970, '2020-02-29T16:29:00', 'qual', '034-q', 'blue', '2412', '2', 25395)
(158, 5, 205968, '2020-02-29T16:29:00', 'qual', '034-q', 'red', '4309', '3', 25395)
(159, 5, 205967, '2020-02-29T16:29:00', 'qual', '034-q', 'red', '4131', '2', 25395)
(160, 4, 205971, '2020-02-29T16:29:00', 'qual', '034-q', 'blue', '4180', '3', 25395)
(161, 4, 205966, '2020-02-29T16:29:00', 'qual', '034-q', 'red', '3070', '1', 25395)
(162, 4, 205963, '2020-02-29T16:22:00', 'qual', '033-q', 'blue', '4682', '1', 25395)
(163, 5, 205961, '2020-02-29T16:22:00', 'qual', '033-q', 'red', '2910', '2', 25395)
(164, 5, 205962, '2020-02-29T16:22:00', 'qual', '033-q', 'red', '4681', '3', 25395)
(165, 5, 205964, '2020-02-29T16:22:00', 'qual', '033-q', 'blue', '7627', '2', 25395)
(166, 5, 205965, '2020-02-29T16:22:00', 'qual', '033-q', 'blue', '8032', '3', 25395)
(167, 5, 205960, '2020-02-29T16:22:00', 'qual', '033-q', 'red', '8059', '1', 25395)
(168, 5, 205956, '2020-02-29T16:15:00', 'qual', '032-q', 'red', '4173', '3', 25395)
(169, 5, 205955, '2020-02-29T16:15:00', 'qual', '032-q', 'red', '1318', '2', 25395)
(170, 4, 205959, '2020-02-29T16:15:00', 'qual', '032-q', 'blue', '2976', '3', 25395)
(171, 5, 205954, '2020-02-29T16:15:00', 'qual', '032-q', 'red', '7461', '1', 25395)
(172, 5, 205958, '2020-02-29T16:15:00', 'qual', '032-q', 'blue', '949', '2', 25395)
(173, 5, 205957, '2020-02-29T16:15:00', 'qual', '032-q', 'blue', '2928', '1', 25395)
(174, 6, 205950, '2020-02-29T15:52:00', 'qual', '031-q', 'red', '4915', '3', 25395)
(175, 6, 205952, '2020-02-29T15:52:00', 'qual', '031-q', 'blue', '2522', '2', 25395)
(176, 5, 205949, '2020-02-29T15:52:00', 'qual', '031-q', 'red', '1294', '2', 25395)
(177, 4, 205953, '2020-02-29T15:52:00', 'qual', '031-q', 'blue', '1899', '3', 25395)
(178, 6, 205948, '2020-02-29T15:52:00', 'qual', '031-q', 'red', '4131', '1', 25395)
(179, 6, 205951, '2020-02-29T15:52:00', 'qual', '031-q', 'blue', '4683', '1', 25395)
(180, 6, 205947, '2020-02-29T15:45:00', 'qual', '030-q', 'blue', '3268', '3', 25395)
(181, 5, 205943, '2020-02-29T15:45:00', 'qual', '030-q', 'red', '3070', '2', 25395)
(182, 5, 205942, '2020-02-29T15:45:00', 'qual', '030-q', 'red', '4089', '1', 25395)
(183, 6, 205945, '2020-02-29T15:45:00', 'qual', '030-q', 'blue', '5588', '1', 25395)
(184, 6, 205944, '2020-02-29T15:45:00', 'qual', '030-q', 'red', '4918', '3', 25395)
(185, 6, 205946, '2020-02-29T15:45:00', 'qual', '030-q', 'blue', '7627', '2', 25395)
(186, 5, 205936, '2020-02-29T15:38:00', 'qual', '029-q', 'red', '2412', '1', 25395)
(187, 6, 205940, '2020-02-29T15:38:00', 'qual', '029-q', 'blue', '4205', '2', 25395)
(188, 6, 205941, '2020-02-29T15:38:00', 'qual', '029-q', 'blue', '8248', '3', 25395)
(189, 5, 205939, '2020-02-29T15:38:00', 'qual', '029-q', 'blue', '2976', '1', 25395)
(190, 5, 205937, '2020-02-29T15:38:00', 'qual', '029-q', 'red', '4682', '2', 25395)
(191, 5, 205938, '2020-02-29T15:38:00', 'qual', '029-q', 'red', '4512', '3', 25395)
(192, 6, 205932, '2020-02-29T15:31:00', 'qual', '028-q', 'red', '949', '3', 25395)
(193, 6, 205933, '2020-02-29T15:31:00', 'qual', '028-q', 'blue', '4681', '1', 25395)
(194, 6, 205931, '2020-02-29T15:31:00', 'qual', '028-q', 'red', '1778', '2', 25395)
(195, 6, 205934, '2020-02-29T15:31:00', 'qual', '028-q', 'blue', '8032', '2', 25395)
(196, 6, 205930, '2020-02-29T15:31:00', 'qual', '028-q', 'red', '1318', '1', 25395)
(197, 5, 205935, '2020-02-29T15:31:00', 'qual', '028-q', 'blue', '4180', '3', 25395)
(198, 6, 205925, '2020-02-29T15:24:00', 'qual', '027-q', 'red', '4173', '2', 25395)
(199, 5, 205924, '2020-02-29T15:24:00', 'qual', '027-q', 'red', '7118', '1', 25395)
(200, 6, 205927, '2020-02-29T15:24:00', 'qual', '027-q', 'blue', '4309', '1', 25395)
(201, 6, 205926, '2020-02-29T15:24:00', 'qual', '027-q', 'red', '2930', '3', 25395)
(202, 6, 205928, '2020-02-29T15:24:00', 'qual', '027-q', 'blue', '8059', '2', 25395)
(203, 6, 205929, '2020-02-29T15:24:00', 'qual', '027-q', 'blue', '3826', '3', 25395)
(204, 6, 205920, '2020-02-29T15:17:00', 'qual', '026-q', 'red', '2910', '3', 25395)
(205, 6, 205922, '2020-02-29T15:17:00', 'qual', '026-q', 'blue', '2903', '2', 25395)
(206, 6, 205923, '2020-02-29T15:17:00', 'qual', '026-q', 'blue', '2928', '3', 25395)
(207, 5, 205918, '2020-02-29T15:17:00', 'qual', '026-q', 'red', '1899', '1', 25395)
(208, 6, 205919, '2020-02-29T15:17:00', 'qual', '026-q', 'red', '4911', '2', 25395)
(209, 6, 205921, '2020-02-29T15:17:00', 'qual', '026-q', 'blue', '4513', '1', 25395)
(210, 7, 205914, '2020-02-29T15:10:00', 'qual', '025-q', 'red', '8248', '3', 25395)
(211, 7, 205916, '2020-02-29T15:10:00', 'qual', '025-q', 'blue', '7627', '2', 25395)
(212, 6, 205917, '2020-02-29T15:10:00', 'qual', '025-q', 'blue', '7461', '3', 25395)
(213, 7, 205913, '2020-02-29T15:10:00', 'qual', '025-q', 'red', '3268', '2', 25395)
(214, 7, 205915, '2020-02-29T15:10:00', 'qual', '025-q', 'blue', '4681', '1', 25395)
(215, 6, 205912, '2020-02-29T15:10:00', 'qual', '025-q', 'red', '492', '1', 25395)
(216, 6, 205911, '2020-02-29T15:03:00', 'qual', '024-q', 'blue', '7118', '3', 25395)
(217, 6, 205910, '2020-02-29T15:03:00', 'qual', '024-q', 'blue', '4512', '2', 25395)
(218, 7, 205907, '2020-02-29T15:03:00', 'qual', '024-q', 'red', '2522', '2', 25395)
(219, 7, 205909, '2020-02-29T15:03:00', 'qual', '024-q', 'blue', '1778', '1', 25395)
(220, 6, 205906, '2020-02-29T15:03:00', 'qual', '024-q', 'red', '1294', '1', 25395)
(221, 7, 205908, '2020-02-29T15:03:00', 'qual', '024-q', 'red', '1318', '3', 25395)
(222, 7, 205902, '2020-02-29T14:56:00', 'qual', '023-q', 'red', '4683', '3', 25395)
(223, 7, 205904, '2020-02-29T14:56:00', 'qual', '023-q', 'blue', '4915', '2', 25395)
(224, 7, 205901, '2020-02-29T14:56:00', 'qual', '023-q', 'red', '4205', '2', 25395)
(225, 6, 205900, '2020-02-29T14:56:00', 'qual', '023-q', 'red', '4089', '1', 25395)
(226, 7, 205903, '2020-02-29T14:56:00', 'qual', '023-q', 'blue', '8032', '1', 25395)
(227, 7, 205905, '2020-02-29T14:56:00', 'qual', '023-q', 'blue', '4173', '3', 25395)
(228, 7, 205894, '2020-02-29T14:49:00', 'qual', '022-q', 'red', '4309', '1', 25395)
(229, 7, 205898, '2020-02-29T14:49:00', 'qual', '022-q', 'blue', '8059', '2', 25395)
(230, 7, 205897, '2020-02-29T14:49:00', 'qual', '022-q', 'blue', '4131', '1', 25395)
(231, 7, 205899, '2020-02-29T14:49:00', 'qual', '022-q', 'blue', '4911', '3', 25395)
(232, 7, 205895, '2020-02-29T14:49:00', 'qual', '022-q', 'red', '2930', '2', 25395)
(233, 6, 205896, '2020-02-29T14:49:00', 'qual', '022-q', 'red', '2976', '3', 25395)
(234, 7, 205892, '2020-02-29T14:42:00', 'qual', '021-q', 'blue', '4513', '2', 25395)
(235, 7, 205888, '2020-02-29T14:42:00', 'qual', '021-q', 'red', '7461', '1', 25395)
(236, 7, 205889, '2020-02-29T14:42:00', 'qual', '021-q', 'red', '3826', '2', 25395)
(237, 7, 205893, '2020-02-29T14:42:00', 'qual', '021-q', 'blue', '5588', '3', 25395)

In [26]:
q = "pragma table_info(Teams);"
pd.read_sql(q, con)

   cid            name     type  notnull dflt_value  pk
0    0              id  INTEGER        0       None   0
1    1            name     TEXT        0       None   0
2    2       long_name     TEXT        0       None   0
3    3            city     TEXT        0       None   0
4    4           state     TEXT        0       None   0
5    5          region     TEXT        0       None   0
6    6    year_founded     TEXT        0       None   0
7    7  matches_played  INTEGER        0       None   0

In [33]:
q = """
CREATE TABLE teams (
    team_id INTEGER PRIMARY KEY,
    team_number TEXT NOT NULL UNIQUE,
    long_name TEXT,
    city TEXT,
    state TEXT,
    region TEXT,
    year_founded INTEGER,
    matches_played INTEGER
);
"""
con.execute(q)
con.commit()

In [37]:
sq = "SELECT * FROM Old_Teams;"
cur = con.cursor()
cur.execute(q)

In [38]:
for tm in cur:
    print(tm)

('measures',)
('enum_measures',)
('schedule',)
('status',)
('Old_Teams',)
('teams',)

In [23]:
# Our first query
query = "SELECT * FROM Teams;"
teams = pd.read_sql(query, con)
teams.head()

,id,name,long_name,city,state,region,year_founded,matches_played
0,0,1318,Issaquah Robotics Society,Issaquah,Washington,None,2004,10
1,1,2928,Viking Robotics,Seattle,Washington,None,2009,10
2,2,2903,NeoBots,Arlington,Washington,None,2009,10
3,3,3070,Team Pronto,Seattle,Washington,None,2009,9
4,4,2930,Sonic Squirrels,Snohomish,Washington,None,2009,10

In [57]:
q = "DROP TABLE measures;"
con.execute(q)
con.commit()

Our first query returned the first six rows of the *Teams* table. This table lists all of the FRC teams that participated in the competition. Each row contains information on a different team

In [8]:
# q = "ALTER TABLE Teams DROP COLUMN id"
# con.execute(q)
# con.commit()

In [18]:
q = "pragma table_info(Teams);"
pd.read_sql(q, con)

   cid            name     type  notnull dflt_value  pk
0    0           index  INTEGER        0       None   0
1    1              id  INTEGER        0       None   0
2    2            name     TEXT        0       None   0
3    3       long_name     TEXT        0       None   0
4    4            city     TEXT        0       None   0
5    5           state     TEXT        0       None   0
6    6          region     TEXT        0       None   0
7    7    year_founded     TEXT        0       None   0
8    8  matches_played  INTEGER        0       None   0

In [87]:
con.close()

ALTER TABLE Locations
RENAME COLUMN Address TO Street;

In [82]:
q = """ALTER TABLE schedule2
            RENAME TO schedule;"""
con.execute(q)
con.commit()

In [74]:
q = """CREATE TABLE schedule2 (
           match_id INTEGER PRIMARY KEY,
         match_date TEXT NOT NULL,
         comp_level TEXT NOT NULL,
           alliance TEXT NOT NULL,
               team TEXT NOT NULL,
            station TEXT NOT NULL,
         last_match INTEGER);"""

con.execute(q)
con.commit()

In [ ]:
CREATE TABLE teams (
    team_id INTEGER PRIMARY KEY,
    team_number TEXT NOT NULL UNIQUE,
    team_name TEXT,
    city TEXT,
    state TEXT,
    region TEXT,
    year_founded INTEGER,
    matches_played INTEGER
)